app/views/comments/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 20]]
---
  <tbody>
    <% @article.comments.each do |comment| %>