app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Beautiful"], ["body", "You are amazing"], ["created_at", "2023-02-28 11:54:38.263004"], ["updated_at", "2023-02-28 11:54:38.263004"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "tech is awes"], ["updated_at", "2023-03-02 11:41:21.788793"], ["id", 19]]
---
  def update
    if @article.update(article_params)