app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 20], ["id", 5], ["LIMIT", 1]]
---
  def show
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "sakshi jain"], ["body", "ppppppppppp"], ["article_id", 41], ["created_at", "2023-03-07 13:14:43.271586"], ["updated_at", "2023-03-07 13:14:43.271586"], ["status", "public"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
---
  def get_details
    @id = params[:id]
    @article = Article.find(params[:id])
    @name = Article.find(@id).title